WEBSITE/app/Controllers/Pages.php

    public function home()
    {
        $beritaModel = new GetBeritaModel();
        $berita = $beritaModel->findAll();
---
SELECT *
FROM `Berita`

    public function edit() {
        $model_berita = new GetBeritaModel();
        $berita = $model_berita->findAll();
---
SELECT *
FROM `Berita`